In [27]:
import pandas as pd
import numpy as np

In [28]:
df = pd.read_csv('raw_messy_dataset.csv')
df

,Name,Age,Gender,Email,Join_Date,Salary,Department
0,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
1,Bob,40,M,user1@example.com,NaN,50000,Engineering
2,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
3,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
4,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering
...,...,...,...,...,...,...,...
100,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
101,Bob,40,M,user1@example.com,NaN,50000,Engineering
102,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
103,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
104,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        105 non-null    object
 1   Age         72 non-null     object
 2   Gender      89 non-null     object
 3   Email       95 non-null     object
 4   Join_Date   70 non-null     object
 5   Salary      78 non-null     object
 6   Department  89 non-null     object
dtypes: object(7)
memory usage: 5.9+ KB

In [30]:
df.head()

,Name,Age,Gender,Email,Join_Date,Salary,Department
0,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
1,Bob,40,M,user1@example.com,NaN,50000,Engineering
2,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
3,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
4,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering

In [31]:
df.tail()

,Name,Age,Gender,Email,Join_Date,Salary,Department
100,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
101,Bob,40,M,user1@example.com,NaN,50000,Engineering
102,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
103,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
104,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering

In [32]:
df.describe()

         Name Age Gender              Email   Join_Date Salary   Department
count     105  72     89                 95          70     78           89
unique     10   5      5                 90           4      5            5
top     Alice  40   Male  user0@example.com  2021-05-21  50000  Engineering
freq       11  22     22                  2          26     22           26

In [4]:
#replaced unknown with NaN
df['Age']= df['Age'].replace('unknown', np.NaN)
df

NameError: name 'df' is not defined

In [18]:
#converted the column to numeric
df['Age'] = pd.to_numeric(df['Age'], errors = 'coerce')
df.head()

NameError: name 'pd' is not defined

In [20]:
#checked unique values
df['Gender'].unique()

NameError: name 'df' is not defined

In [21]:
#convert to standard form
df['Gender'] = df['Gender'].replace({'M':'Male',
                                      'F': 'Female'})
df

NameError: name 'df' is not defined

In [14]:
# convert date column to date format
df['Join_Date'] = pd.to_datetime(df['Join_Date'], errors = 'coerce')

In [15]:
#convert salary column to numeric 
df['Salary'] = pd.to_numeric(df['Salary'], errors = 'coerce')
df['Salary'].head()

0        NaN
1    50000.0
2    50000.0
3    70000.0
4    70000.0
Name: Salary, dtype: float64

In [16]:
#to check null or missing values
df.isnull().sum()

Name           0
Age           46
Gender        16
Email         10
Join_Date     79
Salary        41
Department    16
dtype: int64

In [3]:
#to fill values
df['Age'].fillna(df['Age'].median(), inplace = True)
df['Age'].head()

NameError: name 'df' is not defined

In [4]:
#filled null or blank values by Unknown keyword
df['Gender'].fillna ('Unknown' ,  inplace = True)
df['Gender'].head(10)

NameError: name 'df' is not defined

In [5]:
#to fill values
df['Salary'].fillna(df['Salary'].mean(), inplace = True)
df['Salary'].head(10)

NameError: name 'df' is not defined

In [6]:
#filled null or blank values by Unknown keyword
df['Department'].fillna ('Unknown' ,  inplace = True)
df['Department'].head(20)

NameError: name 'df' is not defined

In [7]:
#filled null or blank values by specific email
df['Email'].fillna ('iGAP@1234' ,  inplace = True)
df['Email'].tail(20)

NameError: name 'df' is not defined

In [8]:
#checked duplicate values
df.duplicated().unique()

NameError: name 'df' is not defined

In [9]:
#drop duplicate values
df.drop_duplicates(inplace = True)

NameError: name 'df' is not defined

In [10]:
df.info()

NameError: name 'df' is not defined

In [11]:
df.to_csv('Cleaned_dataset.csv')

NameError: name 'df' is not defined